# CLI Tools
brew "git"
brew "git-lfs"
brew "awscli"
brew "vercel-cli"
brew "zsh"
brew "zoxide"
brew "difftastic"
brew "eza"
brew "mas"
brew "starship"

# Mac App Store
mas "Xcode", id: 497799835
mas "Xnip", id: 1221250572
mas "Bitwarden", id: 1352778147

# Terminal
cask "ghostty"

# Code Editors
cask "cursor"
cask "zed"
cask "sublime-merge"

# Development Tools
cask "orbstack"
cask "figma"

# Network
cask "clash-verge-rev"

# Productivity
cask "bob"

# Communication
cask "slack"
cask "zoom"
cask "telegram"

# Browsers
cask "google-chrome"

# Fonts
cask "font-fira-code"
