# Taps
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask-fonts"

# CLI Tools
brew "git"
brew "git-lfs"
brew "zsh"
brew "zoxide"
brew "difftastic"
brew "eza"

# Mac App Store command-line interface
brew "mas"

# Terminal
cask "warp"
cask "starship"
cask "ghostty"

# Code Editors
cask "visual-studio-code"
cask "cursor"
cask "zed"

# Development Tools
cask "docker"

# Browsers
cask "google-chrome"

# Communication
cask "slack"

# Fonts
tap "homebrew/cask-fonts"
cask "font-fira-code"
